tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# GNU File, Shell, and Text utilities
brew "coreutils"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Postgres C API library
brew "libpq"
# Object-relational database system
brew "postgresql"
# Persistent key-value database, with built-in net interface
brew "redis"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Lock/unlock Apple computers using the proximity of a bluetooth low energy device
cask "bleunlock"
# Screen capturing tool
cask "cleanshot"
# App to build and share containerized applications and microservices
cask "docker"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Shows the next meeting in the menu bar
cask "meetingbar"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
